# NonContinuousRailInfo Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NonContinuousRailInfo Properties
NonContinuousRailInfo Class See Also
---
The NonContinuousRailInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Height | The height at which the non-continuous rail will be placed. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MaterialId | The material id associated with the non-continuous rail, or invalidElementId if none. |
| Name | The name of the non-continuous rail. |
| Offset | The side offset of the non-continuous rail from a [!:Autodesk::Revit::DB::Architecture::Railing] from the railing center. |
| ProfileId | The profile id of the non-continuous rail, or invalidElementId if none. |

# See Also
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace